[{"rank": "NEED_RANK", "description": "When chemistry teacher Walter White is diagnosed with Stage III cancer and given only two years to live, he decides he has nothing to lose. He lives with his teenage son, who has cerebral palsy, and his wife, in New Mexico. Determined to ensure that his family will have a secure future, Walt embarks on a career of drugs and crime. He proves to be remarkably proficient in this new world as he begins manufacturing and selling methamphetamine with one of his former students. The series tracks the impacts of a fatal diagnosis on a regular, hard working man, and explores how a fatal diagnosis affects his morality and transforms him into a major player of the drug trade.", "title": "Breaking Bad", "id": "0903747"}, {"rank": "NEED_RANK", "description": "Brilliant, but socially inept, forensic anthropologist Dr. Temperence Brennan works at the Jeffersonian Institute in Washington DC. After consulting for him on a FBI case, she is approached by cocky yet charming ex-Army Ranger turned Special Agent, Seeley Booth to help the Bureau solve crimes by identifying human remains that are too far gone for standard FBI forensic investigations. Brennan's empirical, literal view of the world causes friction with Booths emotive, instinctive attitude creating a volatile relationship. However as their case load increases the symbiotic partnership produces results and with the support of Brennan's Squint Squad, murderers, past and present should be on the look out.", "title": "Bones", "id": "0460627"}, {"rank": "NEED_RANK", "description": "After being rescued from an underground bunker in which she lived the past 15 years, Kimmy Schmidt decides to move to New York to have a normal life. She makes friends with her new roommate Titus, and works as a babysitter for Jacqueline Voorhees, the wife of a millionaire with many issues. Even though many obstacles are thrown her way, Kimmy makes the best of her new life while having to adapt to the new world around her.", "title": "Unbreakable Kimmy Schmidt", "id": "3339966"}, {"rank": "NEED_RANK", "description": "U.S. Attorney Chuck Rhoades goes after hedge fund king, Bobby \"Axe\" Axelrod in a battle between two powerful New York figures.", "title": "Billions", "id": "4270492"}, {"rank": "NEED_RANK", "description": "The vampire brothers Damon and Stefan Salvatore, eternal adolescents, having been leading \"normal\" lives, hiding their bloodthirsty condition, for centuries, moving on before their non-aging is noticed. They are back in the Virginia town where they became vampires. Stefan is noble, denying himself blood to avoid killing, and tries to control his evil brother Damon, who promised to Stefan an eternity of misery. Stefan falls in love with schoolgirl Elena, who has an uncanny resemblance to the Salvatore brothers old love, Katherine; and whose best friend Bonnie, is a witch.", "title": "The Vampire Diaries", "id": "1405406"}, {"rank": "NEED_RANK", "description": "Bob's Burgers centers on the Belcher family (consists of Bob, Linda, Tina, Gene and Louise) who own a hamburger restaurant. Bob's burgers are really delicious and appear to be better than his rivals' but when it comes to selling burgers, his kids aren't really helpful, as more customers head over to Jimmy Pesto's restaurant.", "title": "Bob's Burgers", "id": "1561755"}, {"rank": "NEED_RANK", "description": "Follows a female private investigator whose career specialty is exposing fraud for a living.", "title": "The Catch", "id": "4396862"}, {"rank": "NEED_RANK", "description": "When heroes alone are not enough... the world needs legends. Having seen the future, Rip Hunter will desperately try to prevent certain events from happening, by time-traveling; Now Rip Hunter is tasked with assembling a disparate group of heroes and villains to confront an unstoppable threat - not only is the planet at stake, but our timeline itself. The Great Question being asked here is can this ragtag team defeat an immortal threat unlike anything they have ever known?", "title": "Legends of Tomorrow", "id": "4532368"}, {"rank": "NEED_RANK", "description": "SPOILER: Orphan Black follows outsider, orphan and street-wise chameleon Sarah. After witnessing a woman's suicide, Sarah assumes the stranger's identity - who happens to look just like her. Expecting to solve all her problems by cleaning out the dead woman's savings, Sarah is instead thrust headlong into a kaleidoscopic mystery as she realizes the dizzying truth - she and the dead woman are clones. As Sarah searches for answers, she discovers the chilling fact that there are more people like her out there - genetically identical individuals who were planted in unsuspecting birth parents and nurtured in completely different circumstances. With no idea who created the clones, she'll need to discover the reason in a hurry as an assassin is killing them one by one.", "title": "Orphan Black", "id": "2234222"}, {"rank": "NEED_RANK", "description": "Life is laid bare as a group of plane crash survivors find themselves stranded on a remote Pacific island. The trauma of the crash soon becomes overshadowed by the island itself, where unseen creatures stalk the jungle, paranormal happenings abound and astonishing coincidences reveal themselves. In this unique environment emotions swell as the survivors battle their inner and outer demons, and strive to live together - so that they won't die alone.", "title": "Lost", "id": "0411008"}, {"rank": "NEED_RANK", "description": "A father recounts to his children, through a series of flashbacks, the journey he and his four best friends took leading up to him meeting their mother.", "title": "How I Met Your Mother", "id": "0460649"}, {"rank": "NEED_RANK", "description": "A Medical-Based drama centered around Meredith Grey, an aspiring surgeon and daughter of one of the best surgeons, Dr. Ellis Grey. Throughout the series, Meredith goes through professional and personal challenges along with fellow surgeons at Seattle Grace Hospital.", "title": "Grey's Anatomy", "id": "0413573"}, {"rank": "NEED_RANK", "description": "The Doctor, from a race called the Time Lords whose home planet is Gallifrey, travels through time and space in his ship the TARDIS (an acronym for Time and Relative Dimensions In Space) with numerous companions. From time to time he regenerates into a new form (which is how the show has been running since 1963).", "title": "Doctor Who", "id": "0436992"}, {"rank": "NEED_RANK", "description": "Meet the fabulously dysfunctional Gallagher family. Dad's a drunk, Mom split long ago, eldest daughter Fiona tries to hold the family together. Eldest son Philip (Lip) trades his physics tutoring skills for sexual favors from neighborhood girls. Middle son Ian is gay. Youngest daughter Debbie is stealing money from her UNICEF collection. Ten-year-old Carl is a budding sociopath and an arsonist, and toddler Liam is - well, he might actually be black, but nobody has a clue how.", "title": "Shameless", "id": "1586680"}, {"rank": "NEED_RANK", "description": "Dexter Morgan, Miami Metro Police Department blood spatter analyst, has a double life. When he's not helping the Homicide division solving murders, he spends his time hunting and killing bad guys that slip through the justice system. He spends his sun-drenched days solving crimes - and moonlit nights committing them. But not to worry, our cool-blooded Dexter doesn't kill just anyone. He reserves his homicidal hobbies to taking only the lives of other killers.", "title": "Dexter", "id": "0773262"}, {"rank": "NEED_RANK", "description": "At ISIS, an international spy agency, global crises are merely opportunities for its highly trained employees to confuse, undermine, betray and royally screw each other. At the center of it all is suave master spy Sterling Archer, whose less-than-masculine code name is \"Duchess.\" Archer works with his domineering mother Malory, who also is his boss. He also has to deal with his ex-girlfriend, Agent Lana Kane and her new boyfriend, ISIS comptroller Cyril Figgis, as well as Malory's lovesick secretary, Cheryl.", "title": "Archer", "id": "1486217"}, {"rank": "NEED_RANK", "description": "Ichabod Crane is resurrected and pulled two and a half centuries through time to unravel a mystery that dates all the way back to the founding fathers.", "title": "Sleepy Hollow", "id": "2647544"}, {"rank": "NEED_RANK", "description": "Oliver Queen and his father are lost at sea when their luxury yacht sinks, apparently in a storm. His father dies, but Oliver survives for five years on an uncharted island and eventually returns home. But he wasn't alone on the island where he learned not only how to fight and survive but also of his father's corruption and unscrupulous business dealings. He returns to civilization a changed man, determined to put things right. He disguises himself with the hood of one of his mysterious island mentors, arms himself with a bow and sets about hunting down the men and women who have corrupted his city.", "title": "Arrow", "id": "2193021"}, {"rank": "NEED_RANK", "description": "In the criminal justice system, sexually based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.", "title": "Law & Order: Special Victims Unit", "id": "0203259"}, {"rank": "NEED_RANK", "description": "When you get into trouble there's only one person to call, Olivia Pope. Olivia is a professional 'fixer' who makes problems go away before anyone even knows they exist. For the moneyed, the powerful and even the President, Olivia is a legend in her field. Her spectacular success is mostly due to her unbreakable rule of always trust your gut. No matter how careful you are, when you do damage control for a living, you're bound to cause some damage to your own life. She and her crew eat, sleep, live and breathe crisis. Each week, as the team races against the clock to defuse intriguing new problems before they become full-blown disasters, they also have to deal with their own personal issues. They may call themselves 'gladiators in suits', but little by little, Olivia and her crew begin to reveal the chinks in their armor.", "title": "Scandal", "id": "1837576"}, {"rank": "NEED_RANK", "description": "Ever since her short-lived stint as a superhero ended in tragedy, Jessica Jones has been rebuilding her personal life and career as a hot-tempered, sardonic private detective in Hell's Kitchen, New York City. Plagued by self-loathing and a wicked case of PTSD, Jessica battles demons from within and without, using her extraordinary abilities as an unlikely champion for those in need... especially if they're willing to cut her a check.", "title": "Jessica Jones", "id": "2357547"}, {"rank": "NEED_RANK", "description": "A family of adult siblings find that their past secrets and scars are revealed when their black sheep of a brother returns home.", "title": "Bloodline", "id": "3520702"}, {"rank": "NEED_RANK", "description": "Lord Grantham sees his family heritage, especially the grand country home Downton Abbey, as his mission in life. The death of his heir aboard the Titanic means distant cousin Matthew Crawley, a Manchester lawyer, suddenly is next in line and accepts moving onto the vast estate with his even more modernist, socially engaged mother, who clashes with his lordship's domineering, conservative mother, the dowager countess. Marrying off the daughters is another concern. Meanwhile, the butler presides over a staff which serves the family, but also lead most of their entire lives in the servants' quarters, intriguing amongst themselves.", "title": "Downton Abbey", "id": "1606375"}, {"rank": "NEED_RANK", "description": "Captain Flint and his pirates, twenty years prior to Robert Louis Stevenson's classic \"Treasure Island\".", "title": "Black Sails", "id": "2375692"}, {"rank": "NEED_RANK", "description": "The all new \"true crime\" case of Fargo's new chapter travels back to 1979 in Sioux Falls, South Dakota and Luverne, Minnesota, where a young State Police Officer Lou Solverson, recently back from Vietnam, investigates a case involving a local crime gang and a major Mob syndicate. Helping him piece things together is his father-in-law, Sheriff Hank Larsson. The investigation will lead them to a colorful cast of characters that includes Karl Weathers, the town lawyer of Luverne, Minnesota. A Korean War vet, Karl is a flowery drunk blessed with the gift of gab and the eloquence of a true con artist. Joe Bulo, the front man for the northern expansion of a Kansas City crime syndicate. The new face of corporate crime, Joe's bringing a Walmart mentality to small town America. His number two is Mike Milligan. Part enforcer, part detective, Mike is always smiling - but the joke is usually on you. Bulo and his crew have their sights set on the Gerhardt crime family in Fargo, currently led by matriarch Floyd Gerhardt. With her husband at death's door, Floyd takes over the family business, frustrating her eldest son, Dodd Gerhardt. An impatient hothead with a cruel streak to match his ambitions, Dodd can't wait for both his parents to die so he can take over and expand their business from kingdom to empire. Bear Gerhardt is the middle son, an intimidatingly large man who, although inarticulate, is the most decent of his clan. Rye Gerhardt, the youngest of the Gerhardt clan, views himself as a big shot, but in reality he's just a small dog who barks big.", "title": "Fargo", "id": "2802850"}, {"rank": "NEED_RANK", "description": "Majority House Whip Francis Underwood takes you on a long journey as he exacts his vengeance on those he feels wronged him - that is, his own cabinet members including the President of the United States himself. Dashing, cunning, methodical and vicious, Frank Underwood along with his equally manipulative yet ambiguous wife, Claire take Washington by storm through climbing the hierarchical ladder to power in this Americanized recreation of the BBC series of the same name.", "title": "House of Cards", "id": "1856010"}, {"rank": "NEED_RANK", "description": "After the Battle of New York, the world has changed. It now knows not only about the Avengers, but also the powerful menaces that require those superheroes and more to face them. In response, Phil Coulson of the Strategic Homeland Intervention, Enforcement and Logistics Division assembles an elite covert team to find and deal with these threats wherever they are found. With a world rapidly becoming more bizarre and dangerous than ever before as the supervillains arise, these agents of S.H.I.E.L.D. are ready to take them on.", "title": "Agents of S.H.I.E.L.D.", "id": "2364582"}, {"rank": "NEED_RANK", "description": "The assorted humiliations, disasters and rare triumphs of four very different twenty-something girls: Hannah, an aspiring writer; Marnie, an art gallery assistant and cousins Jessa and Shoshanna.", "title": "Girls", "id": "1723816"}, {"rank": "NEED_RANK", "description": "The adventures of Ragnar Lothbrok: the greatest hero of his age. The series tells the saga of Ragnar's band of Viking brothers and his family as he rises to become King of the Viking tribes. As well as being a fearless warrior, Ragnar embodies the Norse traditions of devotion to the gods: legend has it that he was a direct descendant of Odin, the god of war and warriors.", "title": "Vikings", "id": "2306299"}, {"rank": "NEED_RANK", "description": "A woman with no memories of her past (Jane Doe), is found naked in Times Square with her body fully covered in intricate tattoos. Her discovery sets off a vast and complex mystery that immediately ignites the attention of the FBI, which begins to follow the road map of her tattoos into a larger conspiracy of crime, while bringing her closer to discovering the truth about her identity.", "title": "Blindspot", "id": "4474344"}, {"rank": "NEED_RANK", "description": "After enjoying a summer romance, high school students Danny and Sandy are unexpectedly reunited when she transfers to Rydell High. There Sandy must contend with cynical Rizzo and the Pink Ladies in attempt to win Danny's heart again.", "title": "Grease Live!", "id": "4366830"}, {"rank": "NEED_RANK", "description": "Carrie Mathison, a CIA operations officer, is on probation after carrying out an unauthorized operation in Iraq. As a result, she has been reassigned to the Counter terrorism center. Whilst in Iraq, she was warned that an American prisoner had been turned by Al-Qaeda. When Nicholas Brody, a U.S. Marine Sergeant, is rescued after being held hostage since 2003, she suspects that he is the one. While Brody is received home as a war hero, Carrie goes to any lengths necessary to catch him out.", "title": "Homeland", "id": "1796960"}, {"rank": "NEED_RANK", "description": "In 2012, Louisiana State Police Detectives Rust Cohle and Martin Hart are brought in to revisit a homicide case they worked in 1995. As the inquiry unfolds in present day through separate interrogations, the two former detectives narrate the story of their investigation, reopening unhealed wounds, and drawing into question their supposed solving of a bizarre ritualistic murder in 1995. The timelines braid and converge in 2012 as each man is pulled back into a world they believed they'd left behind. In learning about each other and their killer, it becomes clear that darkness lives on both sides of the law.", "title": "True Detective", "id": "2356777"}, {"rank": "NEED_RANK", "description": "Richard \"Rick\" Castle is a millionaire playboy who recently killed off his main character when a serial killer starts killing people like he does in his books. He teams up with New York police detective Kate Beckett to solve the case. He finds inspiration in Detective Beckett and starts shadowing her for his next book.", "title": "Castle", "id": "1219024"}, {"rank": "NEED_RANK", "description": "Eric Forman is a typical high school student growing up in Wisconsin in 1976 with his family and his friends. Together, they have the same kind of joys and sorrows that just about every teenager has while growing up. This show parodied many of the attitudes, events and fads of the 70s, along with those who grew up at the time.", "title": "That '70s Show", "id": "0165598"}, {"rank": "NEED_RANK", "description": "Ned Stark, Lord of Winterfell, becomes the Hand of the King after the former Hand, Jon Arryn, has passed away. But before Ned goes to the capital, King's Landing, a letter arrives from his wife's sister Lysa, who was the wife of Jon Arryn. There it says that her husband was murdered, and it is up to Ned to find out what's going on. But that isn't everything. The White Walkers have been seen, and they seem to go down south.", "title": "Game of Thrones", "id": "0944947"}, {"rank": "NEED_RANK", "description": "Set against the backdrop of the Nashville music scene, the new drama revolves around a 40-year-old superstar Rayna Jaymes, whose star begins fading. She is forced to team up with Juliette Barnes on tour in order to maintain her label's support for her latest record, whose sales have been underwhelming.", "title": "Nashville", "id": "2281375"}, {"rank": "NEED_RANK", "description": "The adventures of Superman's cousin in her own superhero career.", "title": "Supergirl", "id": "4016454"}, {"rank": "NEED_RANK", "description": "A modern take on the cases of Sherlock Holmes, with the detective now living in New York City.", "title": "Elementary", "id": "2191671"}, {"rank": "NEED_RANK", "description": "Steve McGarrett comes to Hawaii to avenge his father's death but when the governor offers his own task force, he accepts. He picks up team members on the way, Danny Williams, the head detective on his father's case, Chin Ho Kelly, a former HPD Detective who was fired for accused corruption and McGarrett's father's old patrol partner, Kono Kalakaua, a Cadet at the Police Academy who's 1 week from graduating, and Captain Lou Grover, a former Chicago PD Head of SWAT.", "title": "Hawaii Five-0", "id": "1600194"}, {"rank": "NEED_RANK", "description": "Both physical and psychological horrors affect a decomposing family, workers and residents of an insane asylum, a coven of witches, a cast of circus freaks, and the employees and guests at a struggling hotel in this haunting anthology series, focusing on the themes of infidelity, sanity, oppression, discrimination, and addiction.", "title": "American Horror Story", "id": "1844624"}, {"rank": "NEED_RANK", "description": "A teacher discovers a time portal that leads to October 21st, 1960 and goes on a quest to try and prevent the assassination of John F. Kennedy, which is complicated by the presence of Lee Harvey Oswald and the fact that he's falling in love with the past itself.", "title": "11.22.63", "id": "2879552"}, {"rank": "NEED_RANK", "description": "As a child Matt Murdock was blinded by a chemical spill in a freak accident. Instead of limiting him it gave him superhuman senses that enabled him to see the world in a unique and powerful way. Now he uses these powers to deliver justice, not only as a lawyer in his own law firm, but also as vigilante at night, stalking the streets of Hell's Kitchen as Daredevil, the man without fear.", "title": "Daredevil", "id": "3322312"}, {"rank": "NEED_RANK", "description": "A night manager of an Egyptian hotel is recruited by intelligence agents to infiltrate an international arms dealer's network.", "title": "The Night Manager", "id": "1399664"}, {"rank": "NEED_RANK", "description": "The series is set 97 years after a devastating nuclear war wiped out almost all life on Earth. The only known survivors are the residents of twelve space stations in Earth's orbit prior to the war. The space stations banded together to form a single massive station named \"The Ark\", where about 2,400 people live. Resources are scarce and all crimes no matter their nature or severity are punishable by death (\"floating\") unless the perpetrator is under 18 years of age. After the Ark's life support systems are found to be critically failing, one hundred juvenile prisoners are declared \"expendable\" and sent to the surface in a last ditch attempt to determine if Earth is habitable again. The teens arrive on a beautiful planet they've only seen from space. Confronting the dangers of this rugged new world, they struggle to form a tentative community. However they discover that not all humanity was wiped out. There are people on Earth who survived the war, called \"grounders\" by the 100. The Ark consists of the space stations previously representing the nations of the UK, USA, Australia, Canada, China, Japan, India, Russia, Venezuela, France, Brazil, and Uganda.", "title": "The 100", "id": "2661044"}, {"rank": "NEED_RANK", "description": "Three years after the zombie virus has gutted the country, a team of everyday heroes must transport the only known survivor of the plague from New York to California, where the last functioning viral lab waits for his blood.", "title": "Z Nation", "id": "3843168"}, {"rank": "NEED_RANK", "description": "Based in Quantico, Virginia, the Behavioral Analysis Unit (BAU) is a subsection of the FBI. Called in by local police departments to assist in solving crimes of a serial and/or extremely violent nature where the perpetrator is unknown (referred to by the Unit as the unknown subject or unsub for short), the BAU uses the controversial scientific art of profiling to track and apprehend the unsub. Profiling entails coming up with basic characteristics of the unsub and the victims (referred to as the victimology), using evidence from the case and matching that information to historic precedents and psychological analyses as a means to solve the case. Because of the nature of the work conducted by the BAU - the work being time consuming and psychologically demanding - its members are fiercely loyal to the Unit and to its other members. Also because of the work's overall demanding nature, not many members of the BAU have been able to maintain a happy or stable family life.", "title": "Criminal Minds", "id": "0452046"}, {"rank": "NEED_RANK", "description": "Follows Flynn, a headstrong Baltimore FBI agent with a dark past, along with Regan, one of the government's most valuable operatives who may be keeping secrets of her own, and McCarthy, an unhinged junkie and Hunter cell leader.. Flynn's search for his missing wife leads him to a secret government unit assembled to hunt a group of ruthless terrorists - shadowy figures that may or may not be from this world.", "title": "Hunters", "id": "4983204"}, {"rank": "NEED_RANK", "description": "Special Agent Leroy Jethro Gibbs is the leader of a team of special agents belonging to the NCIS (Naval Criminal Investigative Service) Major Case Response Team. Gibbs, a former Marine, is a tough investigator and a highly skilled interrogator who relies on his gut instinct as much as evidence. Gibbs' second in command is Senior Field Agent Tony DiNozzo, a womanizing, movie-quoting former Baltimore Homicide Detective, who despite being the class clown always gets the job done. The team also consists of probationary field agent Eleanor Bisbop, a former NSA agent, as well as Junior Field Agent Timothy McGee, a computer-savvy agent often mocked by DiNozzo. Assisting them are Abby Sciuto, the energetic-but-Goth lab tech who is like a daughter to Gibbs, and Dr. Donald Mallard, nicknamed Ducky, the eccentric medical examiner full of unusual stories. This team of elite agents, based in Washington, D.C., solve criminal cases involving Marine and Navy personnel and their families, sometimes traveling the United States - or the world - to do it.", "title": "NCIS", "id": "0364845"}, {"rank": "NEED_RANK", "description": "Leonard Hofstadter and Sheldon Cooper are both brilliant physicists working at Cal Tech in Pasadena, California. They are colleagues, best friends, and roommates, although in all capacities their relationship is always tested primarily by Sheldon's regimented, deeply eccentric, and non-conventional ways. They are also friends with their Cal Tech colleagues mechanical engineer Howard Wolowitz and astrophysicist Rajesh Koothrappali. The foursome spend their time working on their individual work projects, playing video games, watching science-fiction movies, or reading comic books. As they are self-professed nerds, all have little or no luck with women. When Penny, a pretty woman and an aspiring actress from Omaha, moves into the apartment across the hall from Leonard and Sheldon's, Leonard has another aspiration in life, namely to get Penny to be his girlfriend.", "title": "The Big Bang Theory", "id": "0898266"}, {"rank": "NEED_RANK", "description": "Clary Fray is a normal teenager living in Brooklyn with her mother. One day, she discovers that she is descended from a line of Shadowhunters; humans born with angelic blood that fight to protect our world from demons. After her mother is kidnapped, Clary must team up with three Shadowhunters: Jace, Alec and Isabelle and her best friend Simon on a quest to find her mother and recover her past.", "title": "Shadowhunters: The Mortal Instruments", "id": "4145054"}, {"rank": "NEED_RANK", "description": "While running from a drug deal gone bad, Mike Ross, a brilliant young college-dropout, slips into a job interview with one of New York City's best legal closers, Harvey Specter. Tired of cookie-cutter law school grads, Harvey takes a gamble by hiring Mike on the spot after he recognizes his raw talent and photographic memory. Mike and Harvey are a winning team. Even though Mike is a genius, he still has a lot to learn about law. And while Harvey may seem like an emotionless, cold-blooded shark, Mike's sympathy and concern for their cases and clients will help remind Harvey why he went into law in the first place. Mike's other allies in the office include the firm's best paralegal Rachel and Harvey's no-nonsense assistant Donna to help him serve justice. Proving to be an irrepressible duo and invaluable to the practice, Mike and Harvey must keep their secret from everyone including managing partner Jessica and Harvey's arch nemesis Louis, who seems intent on making Mike's life as difficult as possible.", "title": "Suits", "id": "1632701"}, {"rank": "NEED_RANK", "description": "Alicia Florrick is the wife of a former state's attorney for Cook County. He has been imprisoned after a sex and corruption scandal. Alicia must deal with the public humiliation. She must also fend for her two children. After years of being a housewife and mother, she returns to work as a litigator at the law firm Stern, Lockhart & Gardner. She must now prove herself in the courtroom.", "title": "The Good Wife", "id": "1442462"}, {"rank": "NEED_RANK", "description": "A highly articulate, erudite and intelligent businessman and mastermind, \"Red\" Reddington, has allegedly been on the \"10 Most Wanted List\" of various U.S. law enforcement agencies for over 20 years. The legend is that Red is as elusive as he is clever, controlling a labyrinth of creative enterprises, coupled with uncanny ability to gather and finesse information at the drop of a hat. On the first day at FBI for a new female profiler fresh out of Quantico, Red offers to bandy wits with the FBI. Red promises to deliver various criminals and plots previously unknown to any branch of law enforcement... and all Red requests in return is to choose his muse.", "title": "The Blacklist", "id": "2741602"}, {"rank": "NEED_RANK", "description": "Portland detective, Nick Burkhardt, has seen some gruesome crime scenes, but nothing prepares him for the strange visions he begins seeing: seemingly regular people momentarily transforming into hideous monsters. A visit from his only living relative reveals the truth. Nick has inherited the ability to see supernatural creatures, and as a \"Grimm,\" he is tasked with keeping the balance between mankind and the mythological. A reformed \"Big Bad Wolf\" becomes his greatest (and also reluctant) ally and confidant. It's not long before his work as a policeman leads Nick to the criminals he once thought were only found in fairy tales.", "title": "Grimm", "id": "1830617"}, {"rank": "NEED_RANK", "description": "Sons of Anarchy, aka SAMCRO, is a motorcycle club that operates both illegal and legal businesses in the small town of Charming. They combine gun-running and a garage, plus involvement in porn film. Clay, the president, likes it old school and violent; while Jax, his stepson and the club's VP, has thoughts about changing the way things are, based on his dead father's journal. Their conflict has effects on both the club and their personal relationships.", "title": "Sons of Anarchy", "id": "1124373"}, {"rank": "NEED_RANK", "description": "The series follows the life of anti-social, pain killer addict, witty and arrogant medical doctor Gregory House with only half a muscle in his right leg. He and his team of medical doctors try to cure very ill ordinary people in the United States of America.", "title": "House M.D.", "id": "0412142"}, {"rank": "NEED_RANK", "description": "FBI agents Fox Mulder and Dana Scully are different: Mulder is a believer in the paranormal while Scully is not. Together, they investigate paranormal cases which takes them all the way to alien conspiracies within the U.S. government and even puts their lives and careers at risk. Together, they try to solve the mysteries within the U.S. government, no matter what they have to do, and along the way they try to solve any other case that's related to the paranormal.", "title": "The X-Files", "id": "0106179"}, {"rank": "NEED_RANK", "description": "This television drama is about the two Winchester brothers, Sam and Dean, who were raised by their father, John, to hunt and kill all things that go \"bump in the night\" after his wife, Mary, was murdered by an evil supernatural being when the boys were young. 22 years later the brothers set out on a journey, fighting evil along the way, to find their recently missing father who, when they finally meet up with, reveals he knows what killed their mother, a demon, and has found a way to track and kill it. Meanwhile, Sam starts to develop frightening abilities that include death visions, visions of people dying before it actually happens. These visions are somehow connected to the demon who murdered his mother and its mysterious plans that seem to be all about Sam. When their father dies striking a deal with the very same devil that had killed his wife, the brothers, now alone and without their mentor, are determined to finish the crusade their father started. But disturbing revelations about Sam's part in the demon's apocalyptic plans are presented when John's dying last words to Dean are revealed.", "title": "Supernatural", "id": "0460681"}, {"rank": "NEED_RANK", "description": "There are few truly unifying events in American life. When something happens that makes the entire country stop and take notice, we remember it forever. Everybody remembers where they were when O.J. Simpson, riding in a white Bronco, led the police on a low-speed chase all over Los Angeles. This marked the emergence of the 24-hour news cycle and the birth of reality television.", "title": "American Crime Story", "id": "2788432"}, {"rank": "NEED_RANK", "description": "Jess - a bubbly offbeat teacher who is known to burst into spontaneous song - catches her boyfriend with another woman, and needs a new place to live. She moves into a loft with three single guys she's never met before. Nick is a jaded law-school dropout, who usually just wants to be left alone. Schmidt is a flashy businessman, who believes he is a gift to women. Winston is a former athlete who doesn't know what to do, but really needs to win whatever it is. Can this dysfunctional group handle the \"adorkable\" new girl?", "title": "New Girl", "id": "1826940"}, {"rank": "NEED_RANK", "description": "Structural Engineer Michael Scofield turns himself in to the Fox River Penitentiary in order to break out his brother Lincoln Burrows, who is on death row for the murder of the Vice President's brother. But Lincoln was set up by some of the Company (an agency formed by corrupt government officials) guys, headed by General Jonathan Krantz. Michael breaks out from Fox River with his brother Lincoln and other convicts.", "title": "Prison Break", "id": "0455275"}, {"rank": "NEED_RANK", "description": "Lucas Hood (Antony Starr), an ex-con and master thief assumes the identity of a murdered sheriff where he continues his criminal activities. His past seems to haunt him by those he betrayed years earlier. This ex-con imposes his own brand of justice where violence erupts at every turn in the not so quiet Amish town, Banshee, Pennsylvania.", "title": "Banshee", "id": "2017109"}, {"rank": "NEED_RANK", "description": "Scott McCall was just another kid in high school. Until, one night his best friend Stiles brings him to the woods, to look for a dead body, and Scott is bitten by a werewolf. Being a werewolf came with its perks- stronger, faster, new star in the lacrosse team, popularity- but also made it hard to control his anger. Scott has also fallen for the new girl in town, Allison, whose dad is trying to hunt and kill Scott. Scott now has to try and balance his out of control life, figure out how to control his new powers, try not to be killed by the alpha that bit him, and protect Allison- and keep her from finding out his big secret.", "title": "Teen Wolf", "id": "1567432"}, {"rank": "NEED_RANK", "description": "A pair of deep-cover Soviet spies masquerades as a typical DC couple whose children, neighbors, coworkers & friends are completely unaware of their activities. At home, they're the stereotypical parents of stereotypical kids; at work, they pose as travel agents; but at night, they weave a web of confidants, lovers, dupes, and historical figures from the Reagan-era Cold War. The startlingly realistic plot twists force the viewer to consider the real cost of an undeclared war, what it takes to protect one's beliefs, if it's worth it, and if it actually worked for either side.", "title": "The Americans", "id": "2149175"}, {"rank": "NEED_RANK", "description": "A spin-off from The Vampire Diaries and set in New Orleans, The Originals centers on the Mikaelson siblings, otherwise known as the world's original vampires: Klaus (Joseph Morgan), Elijah (Daniel Gillies), and Rebekah (Claire Holt). Now Klaus must take down his protÃ©gÃ©, Marcel (Charles Michael Davis), who is now in charge of New Orleans, in order to re-take his city, as he originally built New Orleans. Klaus departed from the city after being chased down by his father Mikael, while it was being constructed and Marcel took charge. As Klaus has returned after many years, his ego has provoked him to become the king of the city. \"Every King needs an heir\" says Klaus, accepting the unborn child. The child is a first to be born to a hybrid (part vampire, part werewolf) and a werewolf (Hayley).", "title": "The Originals", "id": "2632424"}, {"rank": "NEED_RANK", "description": "Follows the story of Claire Randall, a married combat nurse from 1945 who is mysteriously swept back in time to 1743, where she is immediately thrown into an unknown world where her life is threatened. When she is forced to marry Jamie Fraser, a chivalrous and romantic young Scottish warrior, a passionate relationship is ignited that tears Claire's heart between two vastly different men in two irreconcilable lives.", "title": "Outlander", "id": "3006802"}, {"rank": "NEED_RANK", "description": "Set in the early/mid-1970s, the life and times of a record executive, Richie Finestra (played by Bobby Cannavale). His record company, American Century, has fallen on hard times and he is busy negotiating its sale to Polygram Records. We see how he started in the industry, the start of his company, its ups and downs, the casualties of his progress and what rock music means to him. Meanwhile, he is also an accessory to a murder.", "title": "Vinyl", "id": "3186130"}, {"rank": "NEED_RANK", "description": "Liv Moore, a medical student, got invited in a party which turned into a macabre zombie arena. Liv woke up from dead and became a zombie. For maintaining her humanity she must eat human brains so she began working in coroner's office to access brains. Eating a brain gives her memories and traits of that person. So she helps detective Clive Babineaux to solve the murder as a psychic.", "title": "iZombie", "id": "3501584"}, {"rank": "NEED_RANK", "description": "Elliot Alderson is a young cyber-security engineer living in New York, who assumes the role of a vigilante hacker by night. Elliot meets a mysterious anarchist known as \"Mr. Robot\" who recruits Elliot to join his team of hackers, \"fsociety\". Elliot, who has a social anxiety disorder and connects to people by hacking them, is intrigued but uncertain if he wants to be part of the group. The show follows Mr. Robot's attempts to engage Elliot in his mission to destroy the corporation Elliot is paid to protect. Compelled by his personal beliefs, Elliot struggles to resist the chance to take down the multinational CEOs that are running (and ruining) the world.", "title": "Mr. Robot", "id": "4158110"}, {"rank": "NEED_RANK", "description": "TV series based on Steven Soderbergh's \"The Girlfriend Experience\", which centered on the life of a New York call girl.", "title": "The Girlfriend Experience", "id": "3846642"}, {"rank": "NEED_RANK", "description": "For Emma Swan, life has been anything but a happy ending. But when she's reunited with Henry - the son she gave up for adoption ten years ago - on the night of her 28th birthday, everything changes. The now 10-year-old Henry is in desperate need of Emma's help because he believes from reading a book of fairytales that she's the daughter of Snow White and Prince Charming - who sent her away from the Enchanted Forest to be protected from a curse that was enacted by the Evil Queen. Emma initially refuses to believe a word of Henry's story but soon finds that his hometown of Storybrooke, Maine is more than it seems. Because it's in Storybrooke that all of the classic characters we know are frozen in time with no memories of their former selves - except for the Evil Queen, who is Storybrooke's mayor and Henry's adoptive mother Regina Mills. Now, as the epic \"Final Battle\" for the future of both worlds approaches, Emma will have to accept her destiny and uncover the mystery behind a place where fairytales are to be believed.", "title": "Once Upon a Time", "id": "1843230"}, {"rank": "NEED_RANK", "description": "Rick Grimes is a former Sheriff's deputy who has been in a coma for several months after being shot while on duty. When he awakens he discovers that the world has been ravished by a zombie epidemic of apocalyptic proportions, and that he seems to be the only person still alive. After returning home to discover his wife and son missing, he heads for Atlanta to search for his family. Narrowly escaping death at the hands of the zombies on arrival in Atlanta he is aided by another survivor, Glenn, who takes Rick to a camp outside the town. There Rick finds his wife Lori and his son, Carl, along with his partner/best friend Shane and a small group of survivors who struggle to fend off the zombie hordes; as well as competing with other surviving groups who are prepared to do whatever it takes to survive in this harsh new world.", "title": "The Walking Dead", "id": "1520211"}, {"rank": "NEED_RANK", "description": "Jay Pritchett sits at the head of a large and unconventional family. Now in his second marriage to his gorgeous young wife, Gloria, Jay has been given something of a second chance. Still, old habits are hard to break, and it's trial by fire as he tries to adapt to life with the same passion and vigor that Gloria exhibits, which are matched by her precocious 12-year-old son, Manny. There are some culture clashes, a few misunderstandings, but also plenty of sweet victories along the way. Jay's grown daughter, Claire, and her husband, Phil, are the proud parents of three kids with whom they want that open, healthy, honest relationship. It's not always easy, especially when you have Haley, a teenage daughter who's growing up a little fast, Alex, a too-smart-for-her-own-good middle daughter and Luke, a scatterbrained boy. Add to this that Phil is just a big kid himself, even if he does always have the best intentions. Claire is the anchor, trying her best to run a tight ship and determined not to let her kids have the rebellious childhood she had. Claire's brother and Jay's grown son, Mitchell, is busy raising an adopted daughter, Lily, with his long term partner, Cameron. Opposites attract in this household, with Cameron having a wonderfully big personality and maybe a flare for the dramatic, while Mitchell is more buttoned-down. They balance each other out, and these doting fathers are relishing their roles as parents developing their own little family.", "title": "Modern Family", "id": "1442437"}, {"rank": "NEED_RANK", "description": "The son of a Colorado rancher returns home from a semi-pro football career to run the family business.", "title": "The Ranch", "id": "4998212"}, {"rank": "NEED_RANK", "description": "A mediocre paper company in the hands of Scranton, PA branch manager Michael Scott. This mockumentary follows the everyday lives of the manager and the employees he \"manages.\" the crew follows the employees around 24/7 and captures their quite humerous and bizarre encounters as they will do what it takes to keep the company thriving..", "title": "The Office", "id": "0386676"}, {"rank": "NEED_RANK", "description": "Lucifer, bored from his sulking life in hell comes to live in Los Angeles only to help humanity with its miseries through his experience and telepathic abilities to bring people's deepest desires and thoughts out of them. While meeting with a girl in his nightclub (called Lux), a shootout involving him and the girl leads him to become a LAPD consultant who tries to punish people for their crimes through law and justice.", "title": "Lucifer", "id": "4052886"}, {"rank": "NEED_RANK", "description": "Narcos tells the true-life story of the growth and spread of cocaine drug cartels across the globe and attendant efforts of law enforcement to meet them head on in brutal, bloody conflict. It centers around the notorious Colombian cocaine kingpin Pablo Escobar (Wagner Moura) and Steve Murphy (Holbrook), a DEA agent sent to Colombia on a U.S. mission to capture and ultimately kill him.", "title": "Narcos", "id": "2707408"}, {"rank": "NEED_RANK", "description": "A look at the lives of young FBI recruits training at the Quantico base in Virginia when one of them is suspected of being a sleeper terrorist.", "title": "Quantico", "id": "4428122"}, {"rank": "NEED_RANK", "description": "A billionaire software-genius named Harold Finch creates a Machine for the government that is designed to detect acts of terror before they can happen, by monitoring the entire world through every cell-phone, email and surveillance camera. Finch discovered that the machine sees everything, potential terrorist acts and violent crimes that involve ordinary people. When the government considered violent crimes between normal people \"irrelevant\", Finch built a back door into the system that gives him the social security number of a person involved in a future violent crime so he could act. Partnered with John Reese, an ex-CIA agent, the two work in secret to prevent violent crimes before they can happen. Eventually their activities lead to being hunted by the New York Police Department, CIA Agents in pursuit of Reese who was listed as dead, a computer hacker named Root who wants access to the Machine, and government officials who want to keep all knowledge of the Machine a complete secret.", "title": "Person of Interest", "id": "1839578"}, {"rank": "NEED_RANK", "description": "A man who converts to a controversial following suffers from a crisis of faith.", "title": "The Path", "id": "4789576"}, {"rank": "NEED_RANK", "description": "An average 28-year old man that gains the ability to use the full extent of his brain's capabilities is hired by the FBI as a consultant. A television follow-up of the film Limitless (2011).", "title": "Limitless", "id": "4422836"}, {"rank": "NEED_RANK", "description": "Captain Ray Holt (Andre Braugher) takes over Brooklyn's 99th precinct, which includes Detective Jake Peralta (Andy Samberg), a talented but carefree detective who's used to doing whatever he wants. The other employees of the 99th precinct include Detective Amy Santiago (Melissa Fumero), Jake's over achieving and competitive partner; Detective Rosa Diaz (Stephanie Beatriz), a tough and kept to herself coworker; Detective Charles Boyle (Joe Lo Truglio), Jake's best friend who also has crush on Rosa; Detective Sergeant Terry Jeffords (Terry Crews), was recently taken off the field after the birth of his twin girls; and Gina Linetti (Chelsea Peretti), the precinct's sarcastic administrator.", "title": "Brooklyn Nine-Nine", "id": "2467372"}, {"rank": "NEED_RANK", "description": "Lorelai Gilmore, 32, has such a close relationship with her daughter Rory that they are often mistaken for sisters. Between Lorelai's relationship with her parents, Rory's new prep school, and both of their romantic entanglements, there's plenty of drama to go around.", "title": "Gilmore Girls", "id": "0238784"}, {"rank": "NEED_RANK", "description": "A sexy, suspense-driven legal thriller about a group of ambitious law students and their brilliant, mysterious criminal defense professor. They become entangled in a murder plot that will shake the entire university and change the course of their lives.", "title": "How to Get Away with Murder", "id": "3205802"}, {"rank": "NEED_RANK", "description": "The story of Piper Chapman, a woman in her thirties who is sentenced to fifteen months in prison after being convicted of a decade-old crime of transporting money to her drug-dealing girlfriend.", "title": "Orange Is the New Black", "id": "2372162"}, {"rank": "NEED_RANK", "description": "Before Saul Goodman, he was Jimmy McGill. And if you're calling Jimmy, you're in real trouble. The prequel to \"Breaking Bad\" follows small-time attorney Jimmy McGill as he transforms into Walter White's morally challenged lawyer, Saul Goodman.", "title": "Better Call Saul", "id": "3032476"}, {"rank": "NEED_RANK", "description": "Explorer Sir Malcolm Murray, American gunslinger Ethan Chandler, scientist Victor Frankenstein and medium Vanessa Ives unite to combat supernatural threats in Victorian London.", "title": "Penny Dreadful", "id": "2628232"}, {"rank": "NEED_RANK", "description": "Set in the fictional town of Rosewood, Pennsylvania, the series follows the lives of four girls, Aria Montgomery, Hanna Marin, Emily Fields, and Spencer Hastings, whose clique falls apart after the disappearance of their leader, Alison DiLaurentis. One year later, the estranged friends are reunited as they begin receiving messages from a mysterious figure named \"A\", who threatens to expose their deepest secrets, including ones they thought only Alison knew. At first, they think it's Alison herself, but after her body is found, the girls realize that someone else is planning on ruining their perfect lives.", "title": "Pretty Little Liars", "id": "1578873"}, {"rank": "NEED_RANK", "description": "Spin off series of The Walking Dead that portrays the beginning events of the zombie apocalypse in the West coast during the same time frame when the city of Atlanta was falling under attack, while Rick was in a coma at the local hospital. It shows how the strain was already in full effect in the south while it's just starting in California.", "title": "Fear the Walking Dead", "id": "3743822"}, {"rank": "NEED_RANK", "description": "\"Bates Motel\" is a contemporary prequel to the genre-defining film \"Psycho,\" and gives a portrayal of how Norman Bates' (Freddie Highmore) psyche unravels through his teenage years. Fans discover the dark, twisted backstory of Norman Bates and how deeply intricate his relationship with his mother, Norma (Vera Farmiga), truly is.", "title": "Bates Motel", "id": "2188671"}, {"rank": "NEED_RANK", "description": "A gangster family epic set in 1919 Birmingham, England and centered on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby, who means to move up in the world.", "title": "Peaky Blinders", "id": "2442560"}, {"rank": "NEED_RANK", "description": "After being recruited to a secretive academy, a group of students discover that the magic they read about as children is very real and more dangerous than they ever imagined. But will getting hooked on the thrill of magic distract them from honing their powers when they need them most?", "title": "The Magicians", "id": "4254242"}, {"rank": "NEED_RANK", "description": "A rising attorney finds his perfectly crafted life threatened when his long-lost childhood friends threaten to expose a dark secret from their past.", "title": "Game of Silence", "id": "4074374"}, {"rank": "NEED_RANK", "description": "Lucious, the founder and CEO of a successful record label has been diagnosed with ALS. He must choose one of his three sons to take over the company when he dies. Meanwhile, his ex wife and co-founder, Cookie, has been released from prison and wants to reclaim her rightful place in the company.", "title": "Empire", "id": "3228904"}, {"rank": "NEED_RANK", "description": "Based on the real life of Walter O'Brien, a genius with an IQ of 197. Walter is asked by Homeland Security to put together a special group of gifted individuals to troubleshoot the most difficult problems that the US & the world may encounter.", "title": "Scorpion", "id": "3514324"}, {"rank": "NEED_RANK", "description": "Rachel Green, Ross Geller, Monica Geller, Joey Tribbiani, Chandler Bing and Phoebe Buffay are all friends, living off of one another in the heart of New York City. Over the course of ten years, this average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.", "title": "Friends", "id": "0108778"}, {"rank": "NEED_RANK", "description": "In this modernized version of the Conan Doyle characters, using his detective plots, Sherlock Holmes lives in early 21st century London and acts more cocky towards Scotland Yard's detective inspector Lestrade because he's actually less confident. Doctor Watson is now a fairly young veteran of the Afghan war, less adoring and more active.", "title": "Sherlock", "id": "1475582"}, {"rank": "NEED_RANK", "description": "Barry Allen is a Central City police forensic scientist with a reasonably happy life, despite the childhood trauma of a mysterious red and yellow lightning killing his mother and framing his father. All that changes when a massive particle accelerator accident leads to Barry being struck by lightning in his lab. Coming out of coma nine months later, Barry and his new friends at S.T.A.R labs find that he now has the ability to move at superhuman speed. Furthermore, Barry learns that he is but one of many affected by that event, most of whom are using their powers for evil. Determined to make a difference, Barry dedicates his life to fighting such threats, as The Flash. While he gains allies he never expected, there are also secret forces determined to aid and manipulate him for their own agenda.", "title": "The Flash", "id": "3107288"}, {"rank": "NEED_RANK", "description": "In crime ridden Gotham City, Thomas and Martha Wayne are murdered before young Bruce Wayne's eyes. Although the idealistic Gotham City Police Dept. detective James Gordon, and his cynical partner, Harvey Bullock, seem to solve the case quickly, things are not so simple. Inspired by Bruce's traumatized desire for justice, Gordon vows to find it amid Gotham's corruption. Thus begins Gordon's lonely quest that would set him against his own comrades and the underworld with their own deadly rivalries and mysteries. In the coming wars, innocence will be lost and compromises will be made as some criminals will fall as casualties while others will rise as supervillains. All the while, young Bruce observes this war with a growing obsession that would one day drive him to seek his own revenge as The Batman.", "title": "Gotham", "id": "3749900"}]